In [24]:
import numpy as np
import pandas as pd

In [25]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [26]:
df=pd.DataFrame(data)

In [59]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [28]:
byComp=df.groupby('Company')

In [29]:

"""
!!!!!!!ALERT!!!!!!!!!!!!!!

in course lecture byComp.mean() worked but here it doesn't work and it only wokrs like this byComp.mean('Sales')

!!!!!!!ALERT!!!!!!!!!!!!!!
"""
byComp.mean('Sales')

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [30]:
byComp.sum()

             Person  Sales
Company
FB        CarlSarah    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

In [31]:
byComp.sum('Sales')

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [54]:
#byComp.std()
#byComp.std() is not working in any ways either in byComp.std() or in byComp.std('Sales')

In [53]:
#byComp.mean()

In [37]:
byComp.sum('Sales').loc['FB']

Sales    593
Name: FB, dtype: int64

In [40]:
df.groupby('Company').sum('Sales').loc['GOOG']

Sales    320
Name: GOOG, dtype: int64

In [41]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [42]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [44]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [45]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [49]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64